app/controllers/areas_controller.rb

  def index
    @areas = Area.all
---
SELECT * FROM "areas"

  def show
    @area = Area.find(params[:id])
---
SELECT * FROM "areas" WHERE ("areas"."id" = 0)

  def create
    @area = Area.new(params[:area])
    @area.parent_id = params[:parent_id]
    respond_to do |format|
      if @area.save
---
INSERT INTO "areas" ("extension_analogica", "nombre", "tel_directo", "jerarquia_id", "extension_digital", "area", "parent_id", "email") VALUES('78', 'Coordinacion General de Administración Estatal', '61878', 3, '787', NULL, 1, 'cgae@educacionchiapas.gob.mx')

    def get_areas
      @areas= Area.find(:all, :conditions => ["jerarquia_id = ?",params[:_jerarquia_id] ])
---
SELECT * FROM "areas" WHERE (jerarquia_id = '1')

    def reporte
     @empleados = Empleado.find(:all, :order => "area_id")
    _pdf = PDF::Writer.new(:paper => "LETTER")
    _pdf.select_font "Times-Roman"
    _pdf.margins_cm(2,2,2,2)
       #--- logos oficiales -----
          i0 = _pdf.image "#{RAILS_ROOT}/public/images/chiapas.png", :resize => 0.45, :justification=>:left
          _pdf.move_pointer(-60)
          i1 = _pdf.image "#{RAILS_ROOT}/public/images/hechos.png", :resize => 0.30, :justification=>:right
          #---- Titulo ----
          _pdf.move_pointer(-90)
          _pdf.text to_iso("Secretaria de Educación"), :font_size => 12, :justification => :center
          _pdf.text to_iso("Coordinación General de Administración Federalizada"), :font_size => 12, :justification => :center
          _pdf.text to_iso("Dirección de Informática"), :font_size => 12, :justification => :center
          _pdf.move_pointer(14)
          _pdf.text to_iso("<b>Directorio de Funcionarios</b>"), :font_size => 11, :justification => :center
          #_pdf.move_pointer(10)

          #------ Ordenamos las areas por jerarquia ----------
          areas=[]
            @superarea = Area.find(:first, :conditions => "parent_id is NULL")
---
SELECT * FROM "empleados" WHERE ("empleados".area_id = 6)
SELECT * FROM "areas" WHERE ("areas".parent_id = 1) ORDER BY nombre

              #--- iteracion por cada una de los areas ---
                 for area in areas
                   #----- Validamos si el area tiene empleados asociados -------
                   if area.empleados.size > 0
---
SELECT * FROM "empleados" ORDER BY area_id

    def xml
      #------ Ordenamos las areas por jerarquia ----------
      datos=[]
        @superarea = Area.find(:first, :conditions => "parent_id is NULL")
               for hijo in @superarea.children
                  for nieto in hijo.children
                      for bisnieto in nieto.children
                          for empleado in Empleado.find(:all, :conditions => ["area_id = ?", bisnieto.id], :order => "puesto_id DESC")
---
SELECT * FROM "areas" WHERE ("areas".parent_id = 1) ORDER BY nombre
SELECT * FROM "empleados" WHERE (area_id = 6) ORDER BY puesto_id DESC