app/controllers/empleados_controller.rb

SELECT * FROM "empleados"
---
  def index
    @empleados = Empleado.all

SELECT * FROM "empleados" WHERE ("empleados"."id" = 7)
---
  def show
    @empleado = Empleado.find(params[:id])

INSERT INTO "empleados" ("telefono", "nombre", "puesto_id", "correo", "area_id", "materno", "paterno") VALUES('989', 'Juan MANUEL', 4, 'jmperez@sef-chiapas.gob.mx', 7, 'Matus', 'Perez')
---
  def create
    @empleado = Empleado.new(params[:empleado])

    respond_to do |format|
      if @empleado.save

SELECT * FROM "empleados" WHERE (nombre like '%g%' or paterno like '%g%' or materno like '%g%')
---
    def live_search
      @empleados = Empleado.find(:all, :conditions => ["nombre like ?  or paterno like ? or materno like ?", "%#{params[:searchtext]}%", "%#{params[:searchtext]}%", "%#{params[:searchtext]}%"])