app/controllers/puestos_controller.rb

  def index
    @puestos = Puesto.all
---
SELECT * FROM "puestos"

  def show
    @puesto = Puesto.find(params[:id])
---
SELECT * FROM "puestos" WHERE ("puestos"."id" = 6)

  def create
    @puesto = Puesto.new(params[:puesto])

    respond_to do |format|
      if @puesto.save
---
INSERT INTO "puestos" ("puesto") VALUES('Subdirector')